In [2]:
import pandas as pd

In [3]:
try:
  customers = pd.read_excel('customers.xlsx')
  products = pd.read_excel('products.xlsx')
  purchases = pd.read_excel('purchases.xlsx')
except FileNotFoundError as e:
  print(e)

In [7]:
print('Concatenating a DataFrame. It is similar to union in sql. It is useful when we have same column or index')
print('When concatenating along axis 0 . Pandas alligns the DataFrame based on their column\n')
combined_df = pd.concat([customers,products])
print(combined_df)

Concatenating a DataFrame. It is similar to union in sql. It is useful when we have same column or index
When concatenating along axis 0 . Pandas alligns the DataFrame based on their column

    id first_name   last_name                      email  gender  street_num  \
0    1     Romain   Southcott  rsouthcott0@clickbank.net    Male         1.0
1    2     Cosimo   Molyneaux      cmolyneaux1@wiley.com    Male         NaN
2    3      Bambi     Westrip     bwestrip2@symantec.com  Female      4057.0
3    4     Roarke  Pankettman     rpankettman3@wiley.com    Male        74.0
4    5    Mikaela    Althorpe           malthorpe4@51.la     NaN         NaN
..  ..        ...         ...                        ...     ...         ...
55  56        NaN         NaN                        NaN     NaN         NaN
56  57        NaN         NaN                        NaN     NaN         NaN
57  58        NaN         NaN                        NaN     NaN         NaN
58  59        NaN         NaN                        NaN     NaN         NaN
59  60        NaN         NaN                        NaN     NaN         NaN

   street_name street_suffix         city       state  postcode  Unnamed: 0  \
0    Trailsway          Road    San Diego  California   92127.0         NaN
1          NaN           NaN      El Paso       Texas       NaN         NaN
2     Arkansas        Circle  San Antonio       Texas   78220.0         NaN
3         Debs         Point      Memphis   Tennessee   38150.0         NaN
4          2nd         Drive          NaN         NaN   83732.0         NaN
..         ...           ...          ...         ...       ...         ...
55         NaN           NaN          NaN         NaN       NaN        55.0
56         NaN           NaN          NaN         NaN       NaN        56.0
57         NaN           NaN          NaN         NaN       NaN        57.0
58         NaN           NaN          NaN         NaN       NaN        58.0
59         NaN           NaN          NaN         NaN       NaN        59.0

                          product    cost   company
0                             NaN     NaN       NaN
1                             NaN     NaN       NaN
2                             NaN     NaN       NaN
3                             NaN     NaN       NaN
4                             NaN     NaN       NaN
..                            ...     ...       ...
55                  Peach - Fresh  $20.53     Zazio
56            Muffin Hinge - 211n  $68.63  Fanoodle
57             Bar Bran Honey Nut  $73.05    Yakijo
58  Nut - Almond, Blanched, Whole  $74.28     Eazzy
59       Table Cloth 90x90 Colour  $41.22     Quinu

[1060 rows x 15 columns]

In [13]:
print('Concatenating DataFrames along axis 1 . Pandas allign the DataFrames based on rows.\nIf two DataFrames have similar index then their colums will be placed side by side.\nIf indexes don''t match then new rows are created to accomodate existing date filling NaN in missing entries')
combined_df = pd.concat([customers,purchases],axis = 1)
print(combined_df.head(5))

Concatenating DataFrames along axis 1 . Pandas allign the DataFrames based on rows.
If two DataFrames have similar index then their colums will be placed side by side.
If indexes dont match then new rows are created to accomodate existing date filling NaN in missing entries
    id first_name   last_name                      email  gender  street_num  \
0  1.0     Romain   Southcott  rsouthcott0@clickbank.net    Male         1.0
1  2.0     Cosimo   Molyneaux      cmolyneaux1@wiley.com    Male         NaN
2  3.0      Bambi     Westrip     bwestrip2@symantec.com  Female      4057.0
3  4.0     Roarke  Pankettman     rpankettman3@wiley.com    Male        74.0
4  5.0    Mikaela    Althorpe           malthorpe4@51.la     NaN         NaN

  street_name street_suffix         city       state  postcode  Unnamed: 0  \
0   Trailsway          Road    San Diego  California   92127.0           0
1         NaN           NaN      El Paso       Texas       NaN           1
2    Arkansas        Circle  San Antonio       Texas   78220.0           2
3        Debs         Point      Memphis   Tennessee   38150.0           3
4         2nd         Drive          NaN         NaN   83732.0           4

   id           purch_date  customer_num  product_num  amount     paid
0   1  2019-01-03 00:00:00           823           27      12  $568.92
1   2  2019-01-03 00:00:00           606           28      14  $395.36
2   3  2019-01-03 00:00:00           955            9      17  $510.17
3   4  2019-01-03 00:00:00           577           19       3   $68.49
4   5  2019-01-03 00:00:00           429            8      18  $759.42

In [36]:
print('Merging in Pandas is similar to sql joins and is used to combine DataFrames based on one or more keys.\nIt is useful when you need to combine data that share column columns or indices.\n')
print('Inner Join')
print('If we want to merge the table customers and purchases based on the column ''id'' and only return the rows where id is matched')
joined_df = pd.merge(customers,purchases,how='inner',on = 'id')
print(joined_df.head(2))
print('\n Left Join- This merges the Customers and Purchase DataFrames,\n keeping all rows from the Customers DataFrame (left DataFrame)\n and adding columns from Purchase where id values match. If there is nomatch, NaN is used.')
joined_df = pd.merge(customers,purchases,how='left',on = 'id')
print(joined_df)
print('\nright join')
joined_df = pd.merge(customers,purchases,how='right',on = 'id')
print(joined_df)

print('If two datasets or tables conatains a same column then in the merge method ''suffix'' should be provided to tell them apart\n eg - suffixes=(''_cust'', ''_pur'')')

Merging in Pandas is similar to sql joins and is used to combine DataFrames based on one or more keys.
It is useful when you need to combine data that share column columns or indices.

Inner Join
If we want to merge the table customers and purchases based on the column id and only return the rows where id is matched
   id first_name  last_name                      email gender  street_num  \
0   1     Romain  Southcott  rsouthcott0@clickbank.net   Male         1.0
1   2     Cosimo  Molyneaux      cmolyneaux1@wiley.com   Male         NaN

  street_name street_suffix       city       state  postcode  Unnamed: 0  \
0   Trailsway          Road  San Diego  California   92127.0           0
1         NaN           NaN    El Paso       Texas       NaN           1

            purch_date  customer_num  product_num  amount     paid
0  2019-01-03 00:00:00           823           27      12  $568.92
1  2019-01-03 00:00:00           606           28      14  $395.36

 Left Join- This merges the Customers and Purchase DataFrames,
 keeping all rows from the Customers DataFrame (left DataFrame)
 and adding columns from Purchase where id values match. If there is nomatch, NaN is used.
       id first_name    last_name                           email  gender  \
0       1     Romain    Southcott       rsouthcott0@clickbank.net    Male
1       2     Cosimo    Molyneaux           cmolyneaux1@wiley.com    Male
2       3      Bambi      Westrip          bwestrip2@symantec.com  Female
3       4     Roarke   Pankettman          rpankettman3@wiley.com    Male
4       5    Mikaela     Althorpe                malthorpe4@51.la     NaN
..    ...        ...          ...                             ...     ...
995   996    Merrili        Alman            malmanrn@cornell.edu  Female
996   997    Winonah       Heckle               whecklero@fc2.com  Female
997   998      Tobit         Birt                             NaN    Male
998   999     Issiah  Standbrooke  istandbrookerq@yellowpages.com    Male
999  1000     Elmore       Malpas                             NaN    Male

     street_num street_name street_suffix          city         state  \
0           1.0   Trailsway          Road     San Diego    California
1           NaN         NaN           NaN       El Paso         Texas
2        4057.0    Arkansas        Circle   San Antonio         Texas
3          74.0        Debs         Point       Memphis     Tennessee
4           NaN         2nd         Drive           NaN           NaN
..          ...         ...           ...           ...           ...
995         0.0    Thompson           Way       Reading  Pennsylvania
996       701.0     Rowland          Hill  Indianapolis       Indiana
997         2.0       Basil          Road     Waterbury   Connecticut
998         NaN     Kenwood         Drive      Savannah       Georgia
999       205.0     Farwell          Park       Atlanta       Georgia

     postcode  Unnamed: 0           purch_date  customer_num  product_num  \
0     92127.0           0  2019-01-03 00:00:00           823           27
1         NaN           1  2019-01-03 00:00:00           606           28
2     78220.0           2  2019-01-03 00:00:00           955            9
3     38150.0           3  2019-01-03 00:00:00           577           19
4     83732.0           4  2019-01-03 00:00:00           429            8
..        ...         ...                  ...           ...          ...
995   19610.0         995  2019-06-04 00:00:00           198           20
996   46278.0         996  2019-06-04 00:00:00            96           27
997    6721.0         997  2019-06-04 00:00:00           181            7
998   31405.0         998  2019-06-04 00:00:00           951           54
999   30386.0         999  2019-06-04 00:00:00           435           20

     amount       paid
0        12    $568.92
1        14    $395.36
2        17    $510.17
3         3     $68.49
4        18    $759.42
..      ...        ...
995       7    $609.35
996      14    $663.74
997       2     $27.66
998       4     $87.68
999      18  $1,143.90

[1000 rows x 17 columns]

right join
        id first_name   last_name                      email  gender  \
0        1     Romain   Southcott  rsouthcott0@clickbank.net    Male
1        2     Cosimo   Molyneaux      cmolyneaux1@wiley.com    Male
2        3      Bambi     Westrip     bwestrip2@symantec.com  Female
3        4     Roarke  Pankettman     rpankettman3@wiley.com    Male
4        5    Mikaela    Althorpe           malthorpe4@51.la     NaN
...    ...        ...         ...                        ...     ...
5995  5996        NaN         NaN                        NaN     NaN
5996  5997        NaN         NaN                        NaN     NaN
5997  5998        NaN         NaN                        NaN     NaN
5998  5999        NaN         NaN                        NaN     NaN
5999  6000        NaN         NaN                        NaN     NaN

      street_num street_name street_suffix         city       state  postcode  \
0            1.0   Trailsway          Road    San Diego  California   92127.0
1            NaN         NaN           NaN      El Paso       Texas       NaN
2         4057.0    Arkansas        Circle  San Antonio       Texas   78220.0
3           74.0        Debs         Point      Memphis   Tennessee   38150.0
4            NaN         2nd         Drive          NaN         NaN   83732.0
...          ...         ...           ...          ...         ...       ...
5995         NaN         NaN           NaN          NaN         NaN       NaN
5996         NaN         NaN           NaN          NaN         NaN       NaN
5997         NaN         NaN           NaN          NaN         NaN       NaN
5998         NaN         NaN           NaN          NaN         NaN       NaN
5999         NaN         NaN           NaN          NaN         NaN       NaN

      Unnamed: 0           purch_date  customer_num  product_num  amount  \
0              0  2019-01-03 00:00:00           823           27      12
1              1  2019-01-03 00:00:00           606           28      14
2              2  2019-01-03 00:00:00           955            9      17
3              3  2019-01-03 00:00:00           577           19       3
4              4  2019-01-03 00:00:00           429            8      18
...          ...                  ...           ...          ...     ...
5995        5995           06/20/2019           893           33       5
5996        5996           06/20/2019           566           23      11
5997        5997           06/20/2019           114           19       9
5998        5998           06/20/2019           404           11      20
5999        5999           06/20/2019            88           57       4

         paid
0     $568.92
1     $395.36
2     $510.17
3      $68.49
4     $759.42
...       ...
5995  $411.10
5996  $178.97
5997  $205.47
5998  $429.40
5999  $274.52

[6000 rows x 17 columns]
If two datasets or tables conatains a same column then in the merge method suffix should be provided to tell them apart
 eg - suffixes=(_cust, _pur)

In [34]:
print('Joining - Joining is aconvenient method for combining columns from two potentially \ndifferently-indexed DataFrames into a single result DataFrame.\nIt uses indexes to join DataFrames.')
joined_df = customers.set_index('id').join(purchases)
print(joined_df.head())

Joining - Joining is aconvenient method for combining columns from two potentially
differently-indexed DataFrames into a single result DataFrame.
It uses indexes to join DataFrames.
   first_name   last_name                      email  gender  street_num  \
id
1      Romain   Southcott  rsouthcott0@clickbank.net    Male         1.0
2      Cosimo   Molyneaux      cmolyneaux1@wiley.com    Male         NaN
3       Bambi     Westrip     bwestrip2@symantec.com  Female      4057.0
4      Roarke  Pankettman     rpankettman3@wiley.com    Male        74.0
5     Mikaela    Althorpe           malthorpe4@51.la     NaN         NaN

   street_name street_suffix         city       state  postcode  Unnamed: 0  \
id
1    Trailsway          Road    San Diego  California   92127.0           1
2          NaN           NaN      El Paso       Texas       NaN           2
3     Arkansas        Circle  San Antonio       Texas   78220.0           3
4         Debs         Point      Memphis   Tennessee   38150.0           4
5          2nd         Drive          NaN         NaN   83732.0           5

    id           purch_date  customer_num  product_num  amount     paid
id
1    2  2019-01-03 00:00:00           606           28      14  $395.36
2    3  2019-01-03 00:00:00           955            9      17  $510.17
3    4  2019-01-03 00:00:00           577           19       3   $68.49
4    5  2019-01-03 00:00:00           429            8      18  $759.42
5    6  2019-01-03 00:00:00           275           36      18  $176.76